{
  "year": "2005",
  "month": "03",
  "day": "04",
  "comments": [
    {
      "id": "8",
      "author": "Werner",
      "timestamp": "2005-03-04T23:40:00Z",
      "body": "**I made it!**Yes, it's true. I made it to the top of Flagstaff! I just about turned back at the climb up past Chataqua, and then again at Mile 1. Steve Bailey and Dave Underwood took turns encouraging me. Thanks guys! I think it's a real accomplishment for me to just make it that far. There's some truth to the idea that my doubters fueled my desire to press on. It was a mixture of that and the nice encouragement from Dave and Steve. Watch the next DCJ for a picture of the group that embarked today."
    },
    {
      "id": "9",
      "author": "Linda",
      "timestamp": "2005-03-05T02:38:00Z",
      "body": "Way to go Mark! Just watch out for the descents. -lad"
    },
    {
      "id": "10",
      "author": "Dave",
      "timestamp": "2005-03-07T22:37:00Z",
      "body": "Friday's action started innocently enough. The pack maintained a mostly civilized demeanor as they moved in colorful array through west Boulder's ancient neighborhoods. But once on Flagstaff Mountain, things quickly degenerated into a game of cat and mouse. Leary attacked halfway up the first major climb, Dressler countered, and Underwood fell into the slipstream, already wasted, a broken man. Meanwhile, at the top of the Hole, Bailey and Werner started their bridge-up, setting a blistering pace past the cheering fans shoehorned into the hallowed confines of Panorama Point. Leary pulled strong through Die Lorelie, leaving Dressler and Underwood to patch together an uneasy alliance in response to the all-out assualt by the Bailey-Werner duo. Somewhere in the vicinity of the Snakes, the day's hitherto halcyon weather took a nasty turn, thrashing the peleton with high winds, freezing sleet, and snow. Leary's epic solo effort was now hanging by a slender Antron thread as Werner-Bailey-Dressler-Underwood hastily threw together a desperate echelon. It was on The Wall, the place where so many of cycling's past heroes have met their inner devils, that Leary made his last, furious bid for immortality, hammering his admittedly dated bike up the last few meters of that holiest of hills. Merckx, Hinault, Armstrong, and now Leary. Leary? - Phil Ligget, March, 2005"
    }
  ]
}