{
  "year": "2006",
  "month": "05",
  "day": "09",
  "comments": [
    {
      "id": "110",
      "author": "Dennis",
      "timestamp": "2006-05-02T03:17:00Z",
      "body": "Steve, This is THE classic &quot;old timers&quot; lunch ride. Enough distance, hills, and wind to make it a challenge. Can you break an hour??? I bet Cav can. Dennis"
    },
    {
      "id": "111",
      "author": "Dave",
      "timestamp": "2006-05-02T17:11:00Z",
      "body": "As a classic old-timer, I concur; this is a nice, soft ride in the country. My favorite part: the wind whistling through my dentures as I chuff away down Neva. Sort of a C-sharp minor. ZZZZCCCCSSSSFFFFFHHHH!!! See you guys Thursday."
    },
    {
      "id": "112",
      "author": "Terry",
      "timestamp": "2006-05-02T22:19:00Z",
      "body": "cav rides?! ;-) terry P.S yo steve, thought thurs was gonna be mtn bike day? what happened to super walker? i see how you are... you roadies are all just one big clique aren't you?"
    },
    {
      "id": "113",
      "author": "Anonymous",
      "timestamp": "2006-05-04T04:44:00Z",
      "body": "rain or shine?"
    },
    {
      "id": "114",
      "author": "Steve",
      "timestamp": "2006-05-04T13:43:00Z",
      "body": "If there's rain, I'm going to pass."
    },
    {
      "id": "115",
      "author": "Dave",
      "timestamp": "2006-05-04T14:12:00Z",
      "body": "Rain? I laugh in the face of rain. No nancyboy, I! Actually, one of my post-op directives - the only one I'm following, in fact - requires that I keep the knee dry for a week. So I guess I'll beg off if it starts to drop buckets. Damn. BTW, got up 4-Mile yesterday, saw RL on the way back to the office. He was on his way to physical therapy. Hope they can salvage the ol' bloke; he's got real promise."
    },
    {
      "id": "116",
      "author": "Rob",
      "timestamp": "2006-05-04T17:42:00Z",
      "body": "Hey all: Just got off the phone with Dave, and as I'm so terrified of rain, he suggested that we cancel the ride today so I don't have a phobia-induced heart attack while out riding. Furthermore, the folks in ETFS were calling me, saying something about me needing to deliver data projectors here, there, and everywhere, so I think I need to bag. In solidarity, Dave is bagging too. We'll try again tomorrow! Oh, and for what it's worth, the PT says I can start running UP hills. Anyone care to ride their bike UP flagstaff next week, and then run down? I'll be happy to escort your bike DOWN the hill for you :)"
    },
    {
      "id": "117",
      "author": "Dave",
      "timestamp": "2006-05-04T18:02:00Z",
      "body": "Here's a thought: Since I should still be taking the occassional rest/recovery day as a post-op consideration, I'd be happy to drive you back down Flagstaff one day next week. Let me know."
    },
    {
      "id": "118",
      "author": "Terry",
      "timestamp": "2006-05-05T21:14:00Z",
      "body": "notice how the runners are the ones falling apart and needing physical therapy? ...oh well, guess that's what health insurance is for, eh? tb"
    },
    {
      "id": "119",
      "author": "Rob",
      "timestamp": "2006-05-08T18:36:00Z",
      "body": "Terry, you're so right. I should just stop running right now. I'll trade you a nice pair of running shoes for that swift bike of yours :) Meanwhile, I'm up for the ride tomorrow at lunch."
    },
    {
      "id": "120",
      "author": "Dave",
      "timestamp": "2006-05-09T19:52:00Z",
      "body": "Nice ride guys! Too bad about the wind, but I figure we got a 15% better workout fighting the damn breeze... I'm wiped out. Imagine going UP Neva today!"
    }
  ]
}