{
  "year": "2007",
  "month": "01",
  "day": "23",
  "comments": [
    {
      "id": "258",
      "author": "Dave",
      "timestamp": "2007-01-23T23:37:00Z",
      "body": "Flag is good-to-go on up to the gate. A little ice here and there, otherwise smooth sailing. And where the heck _are_ those Fair-Weather Frenz? Since the big snow, it's been lonely out here. I feel like Condaleeza Rice in a kissing booth. Very neglected. If it weren't for SB and Sir Brian Kent, I'd think they finally dropped the big one. Huge mushroom cloud - all bakery products one-half off! - and there I am, myopic and solo, cranking on up the hill. &quot;Where'd everyone go?&quot; Come on guys... tomorrow let's do some _sparring_!"
    },
    {
      "id": "259",
      "author": "Bryan",
      "timestamp": "2007-01-24T02:24:00Z",
      "body": "Let the road conditions and weather be no excuse tomorrow. It gets even drier above the gate because it's snow-packed instead of slush. Put those fenders on and throw a jacket in your pannier for the descent. Glad to Steve and Dave out there today. I was even more lonely last week. Bryan"
    },
    {
      "id": "260",
      "author": "Linda",
      "timestamp": "2007-01-24T17:00:00Z",
      "body": "Some people understand the concept of taking a break from the bike, letting the body recover, and not doing the same-old every day. Ha! Winter is for winter-time activities, not hill climbing on the bike. -ld"
    },
    {
      "id": "261",
      "author": "Steve",
      "timestamp": "2007-01-24T17:05:00Z",
      "body": "Linda, It's only bad if you go hard everday. :)D"
    },
    {
      "id": "262",
      "author": "Dave",
      "timestamp": "2007-01-24T17:09:00Z",
      "body": "That devil Bailey told me hill climbing on the bike WAS a winter activity. My wife might be right about him after all... he's a bad influence. DU"
    },
    {
      "id": "263",
      "author": "Linda",
      "timestamp": "2007-01-24T17:28:00Z",
      "body": "Never trust anyone under 30 ... -ld"
    }
  ]
}