{
  "year": "2008",
  "month": "07",
  "day": "09",
  "comments": [
    {
      "id": "782",
      "author": "Dave",
      "timestamp": "2008-07-09T17:51:00Z",
      "body": "So I'm riding up Fourmile w/ Bailey the other day when this white van pulls in between us, cuts me off, and screeches to a stop. This little shrew of a guy with bad teeth and a Milwaukee Braves ball cap jumps out and points some sort of little plastic gun at me. Then everything goes black. I dream of barbed wire and wrought iron. After what seems like an eternity, I wake up. Through the lifting fog I see that I'm back in the operating room at the Aurora VoTech. It's freezing. &quot;You didn't listen to me. I said _no biking_ for four weeks.&quot; I turn my head and see that it's my surgeon. She's sitting in a chair next to my bed. The latest People magazine is on her lap, and there's a half-eaten bag of Doritos on the table at her elbow. She smells of horseradish. To be continued...."
    },
    {
      "id": "783",
      "author": "Terry",
      "timestamp": "2008-07-09T19:03:00Z",
      "body": "That's a funny spoof on The 10!"
    },
    {
      "id": "784",
      "author": "Jennifer",
      "timestamp": "2008-07-09T20:15:00Z",
      "body": "Where is &quot;almost all the way to Cedar Brook Road&quot;? Tim rocks."
    },
    {
      "id": "785",
      "author": "Tim",
      "timestamp": "2008-07-09T20:50:00Z",
      "body": "Way to go Tim....! Not bad for a life long lover of fine Virginia tobacs lovingly roasted in cheap corn cob pipes. If I do say so myself. By the way, I remember some promises that if I took up riding, you'd take up smoking (tobacco...!). So, grab your favorite stogie, briar, or pack of cigs (if that's all you have) and we can meet at Regent Michael Carrigan's office for a &quot;Smoke In&quot;. Any takers? Bueller...? Bueller...? Tim"
    },
    {
      "id": "786",
      "author": "Anonymous",
      "timestamp": "2008-07-09T23:12:00Z",
      "body": "I got lost in the twilight zone today and never saw the rest of yas again. Good work Tim! I'll smoke somethin' on your behalf (though I can't say on this blog what it will be). Come to think of it, maybe what I've been smokin' has sumpin' to do with why I got lost in the twilight zone today..."
    }
  ]
}