{
  "year": "2008",
  "month": "11",
  "day": "19",
  "comments": [
    {
      "id": "1074",
      "author": "RL",
      "timestamp": "2008-11-19T18:21:14Z",
      "body": "Booty pads! Booty pads!"
    },
    {
      "id": "1079",
      "author": "Jennifer",
      "timestamp": "2008-11-20T16:13:06Z",
      "body": "To those about to drink a mountain dew: I salute you. Regards, Gunthinator"
    },
    {
      "id": "1080",
      "author": "RL",
      "timestamp": "2008-11-20T16:15:36Z",
      "body": "Happy day, now that winter has at least chosen to drop in, if not stay for a while. In any case, it looks a perfect day for you cyclists to develop some &quot;initiative&quot;... and get out for an icy, rainy run >:)"
    },
    {
      "id": "1081",
      "author": "Dave",
      "timestamp": "2008-11-20T16:53:05Z",
      "body": "I love the taste of Mountain Dew in the morning! Tastes like... Victory. That nasty little wasp who rode part of the way down Boulder Canyon with me yesterday must've been packing some heavy artillery. He tasered me 4 or 5 times while he was onboard, which I find curious. I know that honeybees sting once, then nobly fall on their swords and die. But is not the wasp family subject to any sort of upper limit on moving violations? This guy clearly had been saving up. Today my so-called chest looks like a London Broil. And I'll just bet the little bastid is perched on a rock somewhere above the Elephant Butress this morning, telling his buddies about how he almost drove the milkface on the bike into the ditch yesterday. Hope he freezes to death. Speaking of determined sadists, I had my last follow-up appointment with Our Lady of the Scalpels this week. She's the surgeon who so neatly lifted my rib last June. She was trying to determine if I could still be considered a &quot;billable object,&quot; or if I had any remaining bones she might be needing to fill out her collection. She was positively effusive, and a quick glance at the wall behind her told me why. It was a newly framed and mounted certificate proclaiming her recent acceptance into the International Meatcutters Union, Local No. 5. &quot;I wasn't sure they'd admit me. Their standards are super tough,&quot; she told me. &quot;You must be very proud,&quot; I said. &quot;I am. And you know, in this economy, having a backup is never a bad idea. I think they were especially taken with my skills with the bow saw.&quot; &quot;Me too. You did a real number on me. But other than the sound of the Shop Vac, I hardly remember a thing.&quot; &quot;You were an easy patient. You can put your shirt back on now. Please. Please.&quot; As I buttoned up, she said &quot;Well, everything looks fine. I think you can safely return to your normal activities now.&quot; Great... Problem is, I don't _have_ any normal activities. Right, Frenz? DU"
    }
  ]
}