{
  "year": "2009",
  "month": "05",
  "day": "05",
  "comments": [
    {
      "id": "1366",
      "author": "jennifer",
      "timestamp": "2009-05-05T16:12:09Z",
      "body": "&quot;Dave&quot; and &quot;Mark&quot; are appropriately large, though why &quot;Steve&quot; takes a backseat I'm not sure. Was this handmade? 'Cause I don't see the Gunthenator anywhere on there..."
    },
    {
      "id": "1368",
      "author": "Dave",
      "timestamp": "2009-05-05T16:52:37Z",
      "body": "Good point. Where the hell is the Gunthenator? Mark, did you click the &quot;Filter subversives&quot; button before you rendered this thing? That might explain it. DU"
    },
    {
      "id": "1369",
      "author": "Werner",
      "timestamp": "2009-05-05T18:35:43Z",
      "body": "I'm not sure why the Gunthernator didn't make it in. I guess it's time for Jennifer to start spamming the blog to get her numbers up. I'll get things started: Gunthernator Gunthernator Gunthernator Gunthernator Gunthernator Gunthernator Gunthernator Gunthernator Gunthernator Gunthernator Gunthernator Gunthernator Gunthernator Gunthernator Gunthernator Gunthernator Gunthernator Gunthernator Gunthernator Gunthernator Gunthernator Gunthernator Gunthernator Gunthernator Gunthernator ... That ought to help! :-)"
    },
    {
      "id": "1370",
      "author": "Adriana",
      "timestamp": "2009-05-05T18:41:12Z",
      "body": "I think it's particularly appropriate that &quot;scientists&quot; and &quot;speedlimping&quot; are one on top of the other. &quot;Speedlimping&quot; is the perfect way to describe how I envision my next three years of science research at CU. (In fact, maybe it is also no coincidence that &quot;slavery&quot; appears nearby.)"
    },
    {
      "id": "1371",
      "author": "Werner",
      "timestamp": "2009-05-05T18:41:29Z",
      "body": "Nah, the spam didn't seem to help. See this revised wordle: [BROKEN_URL] Maybe there is something to Dave's suggestion. Or maybe I left the synonym filter on and it translated Gunthernator into &quot;speedlimping.&quot; :-) Mark. P.S. I think the wordle tool doesn't pick up on the blog comments."
    }
  ]
}