{
  "year": "2009",
  "month": "02",
  "day": "24",
  "comments": [
    {
      "id": "1275",
      "author": "Steve",
      "timestamp": "2009-02-25T16:29:04Z",
      "body": "JG, one problem with the whole fleet of &quot;gelvetica&quot; typefaces: not legible, especially in bright sunlight. Really gummed up my MacBook Pro.\n\nThe grass one was easier to use, but I was lost at the kerning instructions: To adjust, find trowel."
    },
    {
      "id": "1274",
      "author": "jennifer",
      "timestamp": "2009-02-25T01:48:07Z",
      "body": "Oh I just remembered to tell you two: I wanted to point you in the direction of a version of helvetica done in toothpaste -- dubbed [gelvetica](http://www.autobahn.nl/english/typography/freshfonts.php). Lol! Also this awesome [grass typer-do](http://www.autobahn.nl/english/typography/evergreen.php). Under #3 at the bottom, there you can try out writing in grass (a flash app, maybe?), and some of the letters even have baubles in them. Bauble is another great word, like muzzy or piffle."
    },
    {
      "id": "1273",
      "author": "Jennifer",
      "timestamp": "2009-02-24T22:48:36Z",
      "body": "Thanks, guys. You sure do write up an outstanding fake award and famous designer bio. What's a banana-belt? Is it what I think it is?"
    },
    {
      "id": "1272",
      "author": "Dave",
      "timestamp": "2009-02-24T18:01:43Z",
      "body": "No me today... still resting the knee, as per Herr Doktor's wishes. Instead, I'll be attending a &quot;Designers Without Borders&quot; meeting w/ Jennifer. It turns out the Gunthenator is up for the prestigious **Si Bodwitz Award** for her heroic efforts in bringing a heightened awareness of typographic nuance to the indigenous peoples of northern Baloowa. (Before her arrival, Souvenir and Microgramma were _rampant._) Si Bodwitz, you may recall, is the hyper-venerated designer who fathered the Swiss Rural design movement in the late eighties and who, for his entire career, eschewed the use of upper-case A's, M's, N's, and W's because he found their angles &quot;hurtful.&quot; It was his lifelong dedication to &quot;muzzy&quot; design that earned him a perch in Dw/oB's pantheon of immortals, and Jen tells us that if she is indeed fortunate enough to receive the award named in his honor, she'll pawn it. She needs a new Mac. Let's all wish her luck. DU"
    }
  ]
}