{
  "year": "2009",
  "month": "12",
  "day": "16",
  "comments": [
    {
      "id": "2381",
      "author": "Greg",
      "timestamp": "2009-12-16T21:25:38Z",
      "body": "Wouldn't you know it. I actually get out for a ride up Flagstaff on a day when both Steve and Dave aren't around. Oh well. Here's hoping our paths cross soon."
    },
    {
      "id": "2383",
      "author": "Werner",
      "timestamp": "2009-12-17T16:25:00Z",
      "body": "For those of you who watched this and said, &quot;huh?&quot;, here's what they were talking about. 12 trucks a towing -- Minnesota in the winter is icy and slick so tow trucks to a banner business throughout the winter. 11 plastic Santas -- A reference to kitschy Minnesotans who have lot's of Christmas lawn ornaments. 10,000 lakes -- The unofficial motto of Minnesota: the land of 10,000 lakes. 9 warming houses -- Ice skating outdoors is possible in Minnesota this time of year, so little huts are set up called [warming houses](http://www.ci.bloomington.mn.us/cityhall/dept/commserv/parkrec/programs/skating/skating.htm) where you change from your boots into your skates; or you come in from the cold where you've been skating to warm up. 8 skaters skating -- Ice skating and ice hockey are big sports in Minnesota. 7 Snoopy statues -- Charles Schulz was born in St. Paul. To honor him, the city has erected many [Snoopy statues](http://www.kaszeta.org/rich/snoopy/) around the city. 6 Loons a laying -- The state bird is the [Common Loon](http://images.google.com/images?client=safari&rls=en&q=minnesota+loon&oe=UTF-8&um=1&ie=UTF-8&ei=LFkqS5uZL4WGswOW-ZXNBA&sa=X&oi=image_result_group&ct=title&resnum=1&ved=0CBcQsAQwAA). 5 hours of sun -- It gets pretty dark in Minnesota in the winter and it's cloudy most of the time. Five hours is an exaggeration, though perhaps near the Canadian border it might be seven hours or so during the winter solstice. 4 Fargo jokes -- There's a friendly North Dakota/Minnesota rivalry. 3 salt bags -- Because it's so icy in the winter, people use salt to keep the sidewalks clear. Some people keep a salt bag in their car to melt the snow near their tires in case they are stuck in the ditch. 2 Ya, You Betchas -- A Minnesota colloquialism for yes. And a giant cherry on a huge spoon -- The Walker Art Center has a sculpture garden which contains a sculpture of a [giant spoon holding a giant cherry](http://images.google.com/imgres?imgurl=http://www.worldofstock.com/slides/AAB1489.jpg&imgrefurl=http://www.worldofstock.com/closeups/AAB1489.php&usg=__sTvgZDkbAyyt_crYTEA0irpW7Qg=&h=333&w=500&sz=48&hl=en&start=12&tbnid=K3ZM8f1EfnzlrM:&tbnh=87&tbnw=130&prev=/images%3Fq%3Dcherry%2Bon%2Bspoon%2Bsculpture%2Bminneapolis%26gbv%3D2%26hl%3Den)."
    },
    {
      "id": "2384",
      "author": "Steve",
      "timestamp": "2009-12-17T16:28:13Z",
      "body": "Wow! Thanks, Mark.\n\nNow we need to come up with some snarky reference for Dr. Werner, like &quot;Werner-pedia.&quot;"
    }
  ]
}