{
  "year": "2010",
  "month": "03",
  "day": "06",
  "comments": [
    {
      "id": "2466",
      "author": "deblkf",
      "timestamp": "2010-03-06T04:20:27Z",
      "body": "...and then I read the other comments and have an answer to my own rhetorical question."
    },
    {
      "id": "2465",
      "author": "deblkf",
      "timestamp": "2010-03-06T04:11:32Z",
      "body": "Really. Is there any (appropriate) comment to leave in response to today's entry? :-)"
    },
    {
      "id": "2462",
      "author": "Werner",
      "timestamp": "2010-03-05T15:27:59Z",
      "body": "I wondered why the flies were circling around that golf bag. The red fox that crossed the fairway kept a safe distance away. I bet he figured the territory around us was marked. I didn't want Steve to feel bad so I endured that acrid stench for 18 holes, but later I tossed it in the garbage can at the Conoco on Table Mesa and Broadway while I was filling up. It's nice of Steve to get the cleaner from Dave, but I don't think any amount of cleaner, especially carpet cleaner, would restore that bag to some semblence of normalcy. Oh well, perhaps this is a good sign that it's time for me to give up golf once and for all. I do have a few frisbee golf discs in the trunk. Maybe I'll take up frisbee golf as a hobby. I can probably fit in nine holes over lunch sometime. There's a course down the hill from Steve's luxury condo on in South Boulder. I'll give that course a shot on a sunny warm day this spring. I guess if Steve comes along, I'll have to watch out for UroDisc (in case they've thought of that for frisbee golfers). Mark."
    },
    {
      "id": "2463",
      "author": "Steve",
      "timestamp": "2010-03-05T16:48:42Z",
      "body": "Mark,\n\nAs it so happens, I've been identified as an Alpha tester for the new UroDisc.\n\nGlamorous as it sounds, Alpha-testing is fraught with risks. Case in point: Dave was on the receiving end of what's known in ultimate circles as a [Scoober throw](http://en.wikipedia.org/wiki/Flying_disc_techniques#Scoober) when the reservoir cork I had carefully replaced popped out. Dave was less upset by the soaking than by new color of his &quot;wife-beater&quot; tanktop—I had nothing but beets the night before.\n\nThen there was the time we accidentally beaned those construction workers (three of them with just one throw). They were pissed.\n\nGood news is, we're about to go into the Beta phase. Any volunteers?"
    },
    {
      "id": "2464",
      "author": "Dave",
      "timestamp": "2010-03-05T17:26:53Z",
      "body": "Let it be noted... The Frenzy sits like old gum on linoleum for _months_ on end, with little more to recommend it than its mortuary calm. But re-introduce the UroClub, and Boy Howdy... you'd think it was a real blog or something. See ya' at 11:45, DU"
    },
    {
      "id": "2467",
      "author": "Steve",
      "timestamp": "2010-03-06T16:21:31Z",
      "body": "Deb, Perspicacious as ever. This vehicle we affectionately call the &quot;Frenzy Trans-Am&quot; bottoms out far too often. Sometimes, when struck at just the right angle, it catches fire too. My advice: flee the scene."
    }
  ]
}