{
  "year": "2010",
  "month": "08",
  "day": "20",
  "comments": [
    {
      "id": "2714",
      "author": "Dave",
      "timestamp": "2010-08-20T19:38:10Z",
      "body": "Steve's right; it's a faculty flood zone. I've sandbagged the low-lying areas around my office, but I don't suspect that will hold much longer. I'm actually preparing to evacuate, grabbing personal records, family photos, and cherished momentos (my MIDOL mousepad). BTW, I really like the wall o' bikes. Reminds me of the [floor o' people.](http://adsoftheworld.com/media/ambient/frontline_mall?size=_original) Toward a more just and verdant world, DU"
    },
    {
      "id": "2715",
      "author": "Werner",
      "timestamp": "2010-08-20T19:56:08Z",
      "body": "I'm starting to think the &quot;Auteurs&quot; frame on the lower right part of the Frenzy is not accurate. A few days ago it showed that Greg Stauffer had 8 posts, Dave Underwood had 88, and Steve had 888. That seemed like a cool coincidence. However if you look at it today, it appears that Dave Underwood has somehow lost a post. He's _down_ to 87. What gives? Mark."
    },
    {
      "id": "2716",
      "author": "Steve",
      "timestamp": "2010-08-20T20:01:45Z",
      "body": "Mark, if there were a Frenzy award for &quot;Most Careful Reader of the Frenzy&quot; you'd win! The reason Dave &quot;lost&quot; a post was that I re-filed his &quot;Black Cats&quot; story in a forthcoming Frenzy section called &quot;Free Wheeling,&quot; wherein Frenz can submit short stories, essays, and the like. I'm very impressed that you even noticed! I've notified the trophy division."
    },
    {
      "id": "2717",
      "author": "Dave",
      "timestamp": "2010-08-20T20:06:11Z",
      "body": "It's significant, I think, that MW is both the Frenzy's most astute _and_ only reader. In that case, he's also the Frenzy's _least_ astute reader, right? Is this what you meant by a Gordian slipknot? DU"
    },
    {
      "id": "2718",
      "author": "Steve",
      "timestamp": "2010-08-20T20:07:49Z",
      "body": "Great! Thanks to you, Dave, I now have to tell the trophy division to make two placards. There goes the 2010-2011-2012 budget!"
    }
  ]
}