{
  "related_post_id": 29,
  "comment_count": 8,
  "comments": [
    {
      "id": 22,
      "author": "Terry",
      "timestamp": "2005-06-09T20:52:00Z",
      "body": "well the skinny tire foolz really put down the beating on us fat tire freaks... little known fact though: dave is really only 24 years old (just spent too much time in the sun) and each of his legs is 6 feet long. also, steve has a third lung. SHHH!! don't tell anyone. terry"
    },
    {
      "id": 23,
      "author": "Dennis",
      "timestamp": "2005-06-10T03:31:00Z",
      "body": "Any chance you freds want to ride next Tuesday at noonish? The old slow one, Dennis"
    },
    {
      "id": 24,
      "author": "Linda",
      "timestamp": "2005-06-14T20:00:00Z",
      "body": "So where were the fellow freds today - it was just me up against Dennis and Steve. I need more company at the back... -Linda"
    },
    {
      "id": 25,
      "author": "Dave",
      "timestamp": "2005-06-14T21:30:00Z",
      "body": "I'm glad I had a good excuse today... and I didn't even have to make it up. Hoping Linda and Dennis can join us again before my next knee surgery! Fred... er...Dave"
    },
    {
      "id": 26,
      "author": "Terry",
      "timestamp": "2005-06-15T16:34:00Z",
      "body": "sorry i missed it... had to help the dean here w/ some last-minute issues before her presentation downtown. when the dean calls, the bike stalls! (or something like that). ;-) terry"
    },
    {
      "id": 28,
      "author": "Terry",
      "timestamp": "2005-06-15T22:16:00Z",
      "body": "P.S. so are you riding sunshine canyon friday? FYI, there is an all-you-can-eat pancake breakfast at the UMC grill... sounds like a chance for some carbo loading! i'm tentatively up for a ride friday. terry"
    },
    {
      "id": 29,
      "author": "Dennis",
      "timestamp": "2005-06-17T22:55:00Z",
      "body": "All, I think we should insist that Dave take the http://www.realage.com/ test to prove his real age. Dennis"
    },
    {
      "id": 33,
      "author": "Linda",
      "timestamp": "2005-06-21T13:50:00Z",
      "body": "So how about a ride up Magnolia sometime soon? -Linda"
    }
  ]
}