{
  "related_post_id": 88,
  "comment_count": 6,
  "comments": [
    {
      "id": 151,
      "author": "Werner",
      "timestamp": "2006-08-05T18:51:00Z",
      "body": "I thought some of you might be up for *watching* cycling at the IMAX theatre in Denver. Check out [Wired to Win: Surviving the Tour de France](http://www.dmns.org/main/en/General/Imax/CurrentFilms/wiredWinImax.htm) --Mark W."
    },
    {
      "id": 152,
      "author": "Steve",
      "timestamp": "2006-08-07T21:34:00Z",
      "body": "Mark, I saw that at the IMAX a while back. Funny story: it was supposed to be called \"Brain Power\" and star Tyler Hamilton, but after he was busted for doping, they cut him from the film. That's why you may have noticed a certain lack of continuity...they had to go back after the Tour de France was over and film those two guys from Francaise des Jeux (Baden Cooke and Jimmy Caspers). Too bad for Tyler, eh?"
    },
    {
      "id": 153,
      "author": "Dennis",
      "timestamp": "2006-08-08T20:38:00Z",
      "body": "Travelogue, date August 8th, time 12:11ish. Participants, Dave \"hammerhead\" Underwood, and, Dennis \"I'm still back here trying to hang on\" Maloney. Hot ride but lots of fun. So, where was everyone else??? Re: \"Wired to Win\" - bike geeks would know that the bikes used in the refilming portion were not yet available for the 2003 TdF. Oops."
    },
    {
      "id": 154,
      "author": "Steve",
      "timestamp": "2006-08-08T21:14:00Z",
      "body": "Dude, We were out there, just running late. We weren't able to sneak out of Telecom until 12:05, and it took us a few to get ready. Obviously, we weren't fast enough to catch you two maniacs. Sorry!"
    },
    {
      "id": 155,
      "author": "Dave",
      "timestamp": "2006-08-09T13:41:00Z",
      "body": "Well now, that's just icing on the cake. I knew Dennis and I were smokin' the route, but now that I know the Frenzies were back in the propwash somewhere, unable to reel us in - even with our 20 minute head start - why, that's just ducky. I guess, in retrospect, I can now freely say that Maloney/Underwood would have dropped the lot of ya' anyhoo. Can't prove otherwise."
    },
    {
      "id": 156,
      "author": "Dennis",
      "timestamp": "2006-08-10T19:37:00Z",
      "body": "All, That was fun! Although Dave and Greg lied to me about portions of the trail, I will try to be a good sport. However, I have a long memory. I expect to have nightmares of stairs. Dennis"
    }
  ]
}