{
  "related_post_id": 989,
  "comment_count": 2,
  "comments": [
    {
      "id": 886,
      "author": "Dave",
      "timestamp": "2008-10-20T14:33:02Z",
      "body": "_Insensitive_ doesn't feel quite right. Not enough bite. While my fingers thrum away at the desktop and I search for a more appropriate word, let's examine the facts. SB has flown over 300,000 miles in just the past six months. While we worker ants have dug ever deeper into the parched sands of the University, our hairfine legs wobbling under burdens twice our size, Herr Bailey has visited Hawaii, Latvia, San Francisco, Washington (all three of them), St Tropez, Tahiti, St. Petersburg, Bermuda, Moscow, Old and New Belgium, London, Paris, Miami, Gandwanaland (still the same old place), Saigon, and the far-flung Isles of Langerhans. That's the short list. Oh, how we \"love\" looking up through sweat-rimmed lids to see yet another of SB's travelogues. Nothing quite like seeing the free flight of the butterfly from the dank confines of the diving bell. Guys in the joint know the feeling; a postcard from Curly (Cell 23, the A-bunk, 16 years) from someplace with lots of sun and, just around the corner, two-for-one specials on well drinks every afternoon. Curly's new friend Lola says hi. But this is _video_, for gosh sake! _Narrator: We liked this spa a lot because, as you can see, Mt. Pukliaki is just visible over the roof of the swim-up bar. And you can almost smell the mint wrap in this scene, can't you? Voice in background: More ice please! And could you let the guy in the Hummer know we'd like the tire pressure lowered a few pounds for the drive up to the waterfall? We detest a rough ride._ It's not as if we don't travel. Last summer there was the trip back to Uncle Gaylan's place in Indiana. What a thrill! Re-brazing a hog trough in the mid-day heat... boy, there's a memory no one can _ever_ steal. And I'll never forget playing deviled egg roulette (Is _this_ the one that they forgot to refrigerate?) in my cousin's double-wide in Garden City. Torrents of fun, true... but is this something you want to see posted on the Frenzy in living color? That's what I thought. We shouldn't complain; we have a good job and a warm seat near a window... Picture Uriah Heep with a Mac, though not nearly as healthy. And next summer, if the Tercel doesn't throw a rod or something, we may get to go see Mom's cousin Sadie in Amarillo. There's a nice HoJo's on the way, and her hide-a-bed is real cush. Now what _is_ that word? DU"
    },
    {
      "id": 887,
      "author": "Steve",
      "timestamp": "2008-10-20T15:03:11Z",
      "body": "Ah... But as my good pal Dave well knows, life is richer for the stories we spin, regardless of whence we spin them."
    }
  ]
}