{
  "related_post_id": 588,
  "comment_count": 6,
  "comments": [
    {
      "id": 829,
      "author": "Rob",
      "timestamp": "2008-09-09T14:47:35Z",
      "body": "hmmm... could it be the frenzy is running slowly today? or is it the shiny new \".org\" attached to the name???? RL"
    },
    {
      "id": 830,
      "author": "dave",
      "timestamp": "2008-09-09T14:48:26Z",
      "body": "I noticed right away that there is a box dedicated to \"Recent Comments,\" and that a certain \"DU\" is an insufferable, long-winded hack. But that's about all. DU"
    },
    {
      "id": 831,
      "author": "Jennifer",
      "timestamp": "2008-09-09T16:02:54Z",
      "body": "Nice! The Frenzy is finally \"official\" with a redirector waving folks over from the . from .blogspot address to its very own url and Bailey must have installed a copy of the blogger free... no, wait... wordpress is the new backend! How much custom code did ya need? But here on Mac Firefox, lines start to disappear from the right side of the comment box, instead of automatically wrapping, curious. In any case, it looks great, very well done, and maybe if there's comment field issues, trash talking won't be as easy as the pie it usually appears to be."
    },
    {
      "id": 832,
      "author": "Jennifer",
      "timestamp": "2008-09-09T16:04:54Z",
      "body": "Ooh, the subtle diagonal line pinstriping just sunk in for me. Just one of many improved, but not gaudy, features of the new design."
    },
    {
      "id": 833,
      "author": "Steve",
      "timestamp": "2008-09-09T17:01:41Z",
      "body": "How astute, all! But Gunther gets top prize. Indeed, last night (until 3:30a), I moved my recently purchased \"flagstafffrenzy.org\" domain into my DreamHost webhosting. Then, I installed WordPress and Gallery2, which no one noticed...the gallery is coming back! Then, I imported all 575 posts and 300 or so comments, as well as all associated media, into WordPress. Then, I had lots of tweaking to do with the design and I just barely got to some custom-scripting before I realized it would be a good idea to sleep. This comment box is annoying, eh, Gunther?! This is just the tip of the iceberg. I have big plans for us. In an excellent [A List Apart article](http://www.alistapart.com/articles/redesignrealign \"Good Designers Redesign, Great Designers Realign\"), Cameron Moll eschews the value of \"realigning\" sites instead of just \"redesigning\" them. That said, there will soon be lots of new functionality that I think y'all will like, plus a new design to accommodate my sprawling and unchecked ambitions. Meantime, thanks for playing! And stay tuned. Now that I'm done with the Buff Bike Classic, I can tend to such important things, or as Adriana would say, waste time on such things"
    },
    {
      "id": 834,
      "author": "Steve",
      "timestamp": "2008-09-09T17:46:10Z",
      "body": "Comment box issue should now be fixed. It was the darn `<textarea>` tag!"
    }
  ]
}