{
  "related_post_id": 1096,
  "comment_count": 3,
  "comments": [
    {
      "id": 963,
      "author": "Dave",
      "timestamp": "2008-11-04T17:24:15Z",
      "body": "I don't know about y'all, but I have a big, cheap slug of champagne scheduled for about ten tonight. That's when we'll see the Drillah from Wasilla step to the mike and give the crowd one of those quivering, brave little smiles… You know the kind; like when you rolled up your sleeve and got your first tetanus shot. Mom was _so_ proud and the nurse gave you a cherry lollipop. SP will tell her adoring little goslings that they fought the good fight and that they have _everything_ to be proud of. The standard ode to the common loser. (I heard it every Saturday for two years when I played Little League football. We won approximately zero games.) Then, as the crowd approaches mass embolism, she'll turn and walk off the stage. As she passes a wildly clapping Joe the Plumber, she'll lean slightly toward him and whisper \"Interested in Secretary of Labor in 2012?\" I'll pour my second tumbler and switch back to Barack's victory party. There, that's _much_ better. DU"
    },
    {
      "id": 975,
      "author": "Kate",
      "timestamp": "2008-11-05T14:35:55Z",
      "body": "At least you did not use the pic of you \"helping\" me walk where you were actually pushing me down. :) I'm very excited to see you! Love, me PS - My fears of mountain lions are not irrational."
    },
    {
      "id": 976,
      "author": "Dave",
      "timestamp": "2008-11-05T15:41:10Z",
      "body": "Uh oh. The Frenzy is moving into Dr. Phil territory. A sibling grudge exposed to the light of day after a decade's-long dormancy. Family dynamics. Phobias. Manias. Political struggles and crib-borne psycho-terrorism. Now that I know the meter's running (\"Welcome to the Frenzy. The Doctor will be with you shortly. Please have your credit card handy.\"), I'll be brief... My Mom always liked my brother best. She told him that if he worked hard, applied himself, and got really good grades, he could have his own dry-cleaning business some day. After all, that's what dreams are for. Me? A different story. _Keep your sock drawer organized, tuck your shirt in, and if you're lucky, you'll stay out of prison. Screw up and you'll end up on a bicycle with a bunch of guys half your age... And watch out for mountain lions.\"_ DU PS, Gobama!"
    }
  ]
}