{
  "related_post_id": 1282,
  "comment_count": 7,
  "comments": [
    {
      "id": 1147,
      "author": "RL",
      "timestamp": "2008-12-15T15:45:36Z",
      "body": "sure sure, sounds fun and frigid! RL"
    },
    {
      "id": 1149,
      "author": "Greg",
      "timestamp": "2008-12-15T17:19:54Z",
      "body": "I got a rule that when it's cold enough to take your breath away, I don't exercise outside. Y'all are nuts. Think I might hit the Rec Center."
    },
    {
      "id": 1150,
      "author": "Brian",
      "timestamp": "2008-12-15T20:56:15Z",
      "body": "While I was out running on Flagstaff today, I actually saw some maniac out on a bike! Skinny tires! Oh, that was no maniac - that was Dave. Running in this is minor league compared to riding Flagstaff in it."
    },
    {
      "id": 1151,
      "author": "Dave",
      "timestamp": "2008-12-15T21:13:33Z",
      "body": "I coulda' used that codpiece today. I forgot and left it at home, hooked up to the charger. (BTW, if you own the Model SS4-36B, don't forget to pull those cables _before_ you put it on. _Oh...my...God_) No matter... I had a delightful ride w/out it today. And it looks like I made my goal of doing Flag with 100° bookends. It was minus .49° when I left and plus .9° when I got back (Foothills Lab).... Good enough; I know I've ridden it when it was at least 101°. Mission accomplished, codpiece or no. DU"
    },
    {
      "id": 1152,
      "author": "RL",
      "timestamp": "2008-12-15T21:25:03Z",
      "body": "Good lord, Dave! You're crazier than I thought!!! It was a good run, Thanks, Steve, for makin' it so! RL"
    },
    {
      "id": 1153,
      "author": "ktbikes",
      "timestamp": "2008-12-15T21:53:46Z",
      "body": "Hey-- Yaktrax \"walkers\" or \"pro\"? You guys are nuts. I'm going to ride the rollers. KK"
    },
    {
      "id": 1154,
      "author": "Steve",
      "timestamp": "2008-12-15T22:18:09Z",
      "body": "Brian, Dave's asinine feats have always (falsely) given me the sense I'm well-grounded! My size 13 feets further reinforce that sense. KTK, Yaktrax Pro!"
    }
  ]
}