{
  "related_post_id": 1315,
  "comment_count": 6,
  "comments": [
    {
      "id": 1169,
      "author": "RL",
      "timestamp": "2008-12-22T17:20:04Z",
      "body": "So cold, Dave! What were you hoping for? I'm leaning towards a run... but hate to leave you \"out in the cold\" as it were... RL"
    },
    {
      "id": 1170,
      "author": "Dave",
      "timestamp": "2008-12-22T17:43:46Z",
      "body": "Cold? What cold? Actually, I'd much rather run today as well, believe me. But just look at these knees, wouldya'? Holy crap; even my orthopedist/paleontologist has taken to working on me blindfolded. He says he just can't operate the SawzAll when he's that disturbed. What a lightweight. Afraid I'm stuck on the bike no matter the weather. Have a good run, Roberto! DU"
    },
    {
      "id": 1171,
      "author": "Greg",
      "timestamp": "2008-12-22T18:35:16Z",
      "body": "I'm also thinking it's a good day for a run and a very cold day for a ride. I'll probably drive up to the trail if either of you want to join me for a run or hike. The train will be leaving from lot 310 (behind Wardenburg & Cheyenne/Arapahoe) about noon if you want to join. I'll try hard not to lock my keys in the car this time, Rob."
    },
    {
      "id": 1172,
      "author": "ktbikes",
      "timestamp": "2008-12-22T20:07:38Z",
      "body": "Hey guys, I \"ran\" in the snowy northeast woods today and found that knee-deep snow=5,400' aka I had to stop (to keep my heart from exploding) just as often on the uphills here as I did running in Boulder! Happy Holidays!! KK"
    },
    {
      "id": 1173,
      "author": "RL",
      "timestamp": "2008-12-22T21:18:38Z",
      "body": "Well, Mr. Stauffer proved a man of his word, and the two of us met up at the Chautauqua parking lot. From there we skittered our way up Gregory Canyon, topping out by taking the Ute trail over Flagstaff. We meandered back down the Flagstaff Trail to Crown Rock, where we found ourselves on dry ground (!!!) for most of the way back down. We even ceremoniously removed our Yax Trax to commemorate the occasion. We made it back to the Chautauqua Lot with a minimum of fanfare, and back to our desks soon after that. We didn't see DU on Flag, although we certainly were on the lookout. Cold? Icy? Where were you, Dave???"
    },
    {
      "id": 1174,
      "author": "Dave",
      "timestamp": "2008-12-22T21:43:45Z",
      "body": "I was there, Rob, but I was thoroughly bundled up and you probably didn't recognize me. I was actually so overdressed (9 layers on top, 4 below) that the descent felt great! I really needed to cool off. Glad you guys had a good run! DU"
    }
  ]
}