{
  "related_post_id": 515,
  "comment_count": 3,
  "comments": [
    {
      "id": 744,
      "author": "Terry",
      "timestamp": "2008-06-02T18:47:00Z",
      "body": "Those are great scenes. Thanks."
    },
    {
      "id": 745,
      "author": "Dave",
      "timestamp": "2008-06-02T20:49:00Z",
      "body": "SB asked, so here I go... my morning commute: I'm riding the bike in to work w/ a pack full of groceries on my back (lunches for the week). I'm southbound on the Diagonal, have a flat, fix it, get about 150 feet down the road, have another flat. No more spare tubes. I want to call Ronna for a lift, but realize I've forgotten my cell phone. I start walking off toward the soccer fields, borrow a cell phone from a nice lady walking a beagle, call Ronna, tell her I'll be over on Iris in 15 minutes. I walk all the way down some very quiet street by the cemetery, realize it's a dead-end, and that there's a 6 - 7 foot high chain link fence with a very ragged top between me and Iris. Bummer. I hang the bike on the top of the fence, toss the pack over, then remember the yoghurt (that's right; it all popped open inside the pack) I take off my cleats and climb the fence barefoot, slicing up my big toe and tearing my shorts on the way over... _rrrriiip_. Then I drag my bike across, bending one of the shifters and screwing up the front brakes. I walk over to Iris and wait for Ronna. And wait. And wait. To put more zest into the situation, I've had a full pot of coffee for breakfast, and I could really use a little privacy and a bush. No luck; it's rush hour and the nearest tree is in the front yard of the day care across the street (Wouldn't _that_ be a headline?). The only thing that keeps my mind off my increasing agitation is watching the two colonies of ants fight over the yoghurt oozing out of the bottom of my pack. The reds prevailed just as Ronna pulled up and asked me why I was so damn grumpy. But enough about my day; how are things going in your world?"
    },
    {
      "id": 746,
      "author": "Steve",
      "timestamp": "2008-06-02T19:56:00Z",
      "body": "Dave, Silver lining: we won't be able to tell if you have any new holes in your cycling shorts. Hey, with a morning like that, you've gotta really stretch to take away something positive."
    }
  ]
}