{
  "related_post_id": 983,
  "comment_count": 6,
  "comments": [
    {
      "id": 881,
      "author": "Steve",
      "timestamp": "2008-10-17T15:48:44Z",
      "body": "Wow! Judging from the [feature story](http://www.colorado.edu/) on the CU homepage, looks like Adriana has been hard at work since returning to Boulder.\n\nCIRES has [its own chronicles of the research project](http://cires.colorado.edu/science/field/vapor/) too. Ah, YouTube seems to have compressed my video. I'll bet it was out of Gunther's hands...just a hunch!"
    },
    {
      "id": 882,
      "author": "jcl",
      "timestamp": "2008-10-17T17:29:38Z",
      "body": "Did you have that camera in your helmet?"
    },
    {
      "id": 883,
      "author": "Steve",
      "timestamp": "2008-10-17T19:38:19Z",
      "body": "Hi, JCL(?). Actually, I only had one hand on the handlebars for all those shots. I thought about putting up the warning \"Do not try this at home,\" but I figured most of my gentle readers already regard Frenzy activities and tales with that caveat in mind. Thanks for commenting!"
    },
    {
      "id": 884,
      "author": "Dave",
      "timestamp": "2008-10-17T20:31:33Z",
      "body": "Thanks for sharing the video Steve! I'm glad the souvenir shops in SF still sell these tapes. In fact, I think I used to own this exact one. It's nice, but Number 314 in the series, _Hurdling the Homeless_ is still my favorite. Some really good footage of jumping over the streetsleepers on lower Polk Street. I'm still not sure how they filmed it; they clear some really BIG guys! Other than the trip down to Hal's Kurio Korner, did you get out of the room much? I mean other than to the \"conference?\" Hope everything went well and that Mastercard still XXXXXXX's out that one line on the receipts. I had a problem with that once, but then I'm a designer, so it was fixable. Let me know if you need help. We miss you. Tim told me to say that. DU"
    },
    {
      "id": 885,
      "author": "Jennifer",
      "timestamp": "2008-10-17T21:34:23Z",
      "body": "Heya Steve, Had a wrassle with the lovely video, but was unsuccessful in wrapping it in a nice .flv format. If you can believe it, what you saw was YouTube's interpretation of your lovely .flv. Anyway I keep talking with Mz. Bailey about how Mike (our web developer) and I would love your help developing a more permanent video solution. YouTube was a last resort. Hope you're recovering from any jet lag and enjoying the town, human condition that Dave refers to and all. Glad your rags worked ;)"
    },
    {
      "id": 888,
      "author": "Greg",
      "timestamp": "2008-10-20T17:04:47Z",
      "body": "As if your trip to Hawaii wasn't enough. You had to hit S.F. too! Very jealous. BTW, Camille and I did the same ride you did but on a tandem. I think it's Camille's favorite ride of all time and probably mine too."
    }
  ]
}
