{
  "related_post_id": 551,
  "comment_count": 7,
  "comments": [
    {
      "id": 798,
      "author": "Dave",
      "timestamp": "2008-07-24T14:31:00Z",
      "body": "I don't know about y'all, but I think it's a little sad seeing MB end up like this. In fact, I couldn't get all the way through the clip... just too many bad memories. You see, I lost an uncle to recreational hypoxia, and the sight of MB and his addled pals doing the ol' \"Paddy-Cake Punchup\" just hits me square in the gut. Jeez... give me a moment; I'm tearing up again. The whole thing is still so fresh in my mind. Sniff. There, I feel better now, thanks for that Kleenex. At least they're still wearing their clothes. When the Sheriff's Department finally broke the door down and found my uncle and the other \"Paddy Cake PunchBoyz,\" it wasn't a pretty sight. Helmets and G-suits scattered about, amyl nitrate caps ground into the carpet, a pyramid of empty Mountain Dew cans in the center of the room, and Donny Osmond's \"I Wanna' be a Flyboy, too\" still looping on the iPod. God... there I go again... sniff. I just hope our boy in blue puts the brakes on before he skids into a fate like my uncle's. This really is no time to get into bad habits like this. Hell, there's a war on, in case you didn't notice."
    },
    {
      "id": 799,
      "author": "Greg",
      "timestamp": "2008-07-24T15:41:00Z",
      "body": "Hey guys. Greetings from southern Virginia. I just needed to point out to the working masses that I've been enjoying a lot of the Tour as it happens. Yesterday's ride up d'Huez was a highlight. Lots of attacking and masterful riding by the CSC guys to protect the break by Sastre. When it comes to biking, as a participation sport, I'm having to live vicariously as I don't have a bike here, but I am doing some running. It's just a little tough when it's 80 F at 7 am with 80 percent humidity. See y'all next week."
    },
    {
      "id": 800,
      "author": "Jennifer",
      "timestamp": "2008-07-24T16:33:00Z",
      "body": "Dang! The air force looks like fun. Reminds me of my days in the circle, chanting something that made the paddy cakes easier. \"Stella ella ola Quack quack quack Say es chigo chigo Chigo Chigo Cack Chack Es Chigo Chigo Vallo Vallo, Vallo vallo vallo Say 1-2-3-4-5\" Something you could try, Mr. MB? Maybe if D's uncle and his cronies had been using the power of the chant, they wouldn't have ended up loosing consciousness to Osmond... maybe. Vive la Tour!"
    },
    {
      "id": 801,
      "author": "Steve",
      "timestamp": "2008-07-24T19:13:00Z",
      "body": "Greg, I can't believe you're running in VA at the height of summer. Don't they measure humidity in gallons there?"
    },
    {
      "id": 802,
      "author": "Dave",
      "timestamp": "2008-07-24T20:54:00Z",
      "body": "Remember though, Steve. Greg doesn't sweat, he _glows_."
    },
    {
      "id": 803,
      "author": "Matt",
      "timestamp": "2008-07-25T02:51:00Z",
      "body": "Dave, you leave me speechless. Or oxygen-less... one of the two."
    },
    {
      "id": 804,
      "author": "Rob",
      "timestamp": "2008-07-25T16:50:00Z",
      "body": "When I ran x-country in VA, we never complained about the humidity. doing so would inevitably lead one to a \"private meeting\" with coach kelly in his, er, office."
    }
  ]
}