{
  "related_post_id": 1588,
  "comment_count": 3,
  "comments": [
    {
      "id": 1303,
      "author": "Berly",
      "timestamp": "2009-03-12T16:04:10Z",
      "body": "I am considering getting Steve the Uroclub towel but realized he only needs a washcloth! Saving money in these economic times ;-)"
    },
    {
      "id": 1304,
      "author": "Dave",
      "timestamp": "2009-03-12T19:21:29Z",
      "body": "I've actually been the proud owner of the Uroclub since 2003, and, believe me, this baby is a life-saver. I bought mine at Skilly's Golf and Tennis in the old Crossroads Mall and, other than a bit of confusion in the fitting room and a frantic 911 call to Boulder Fire and Rescue, the purchase and initial training were a breeze. (By the way, the \"Jaws of Life\" can be surprisingly gentle, in case you've ever wondered.) The Uroclub came with an instructional DVD which covered the basics: _\"¢Â Never point a loaded Uroclub at another person, not even in jest._ (My mother-in-law still goes on and on about this.) _\"¢Â Never leave your Uroclub in a hot, parked car._ (Oy!) _\"¢ The Uroclub is designed for relief only, and should NEVER be used to pitch out of a sand trap, especially when full._ (Even though it does knock hell out of the ball when it's hauling about two gallons of recycled Avery's.) My Uro is great on the golf course, but I've found that it stands out a bit in meetings, in church, or at school functions. Whatever. Once you get over the snarky looks, the thing is just so damn useful you never want to be without it. I absolutely love mine! And, Berly, the crack about SB and the washcloth? He's lucky; I get by with a silk hanky. DU"
    },
    {
      "id": 1305,
      "author": "Tim",
      "timestamp": "2009-03-12T19:42:41Z",
      "body": "Kimberly, You are SOOOO flattering to suggest a washcloth for Steve's needs. However, the question begs asking... How is it your familiar with Steve's \"coverage\" needs? I shudder in fear at the questions awaiting Steve when he arrives home to his (hopefully!) understanding and forgiving wife. I can hear it now... (spoken with a heavy Cuban accent) LUUUUCCCCY, you have some 'splaining to do...!"
    }
  ]
}