{
  "related_post_id": 1382,
  "comment_count": 5,
  "comments": [
    {
      "id": 1210,
      "author": "jennifer",
      "timestamp": "2009-01-22T20:17:49Z",
      "body": "No comments!? What? An injustice. High school shenanigans of that caliber deserve recognition. May we all be so lucky to have video evidence of our long-spent youthful creativity, and be able to share it with Frenz! Mrs. Brown! Carrie! Now where's the fast-forward on this thing..."
    },
    {
      "id": 1211,
      "author": "Dave",
      "timestamp": "2009-01-22T20:53:24Z",
      "body": "I agree w/ JG about the fast forward; I clawed for the damn thing. And once the tape started rolling, I had this sick, visceral feeling I used to get when the attendant strapped me into the Tilt-O-Whirl at the Whizbang County Fair, this feeling of helpless, round-eyed surrender, of knowing that, for the next X minutes, my life and my lunch would be in someone else's hands. But it wasn't all that bad, in retrospect. I made it all the way through the video in one piece and now I feel stronger for it. This may, in fact, be one of the better New England high school snuff films I've ever seen... admittedly a very thin niche. Great ride down Boulder Canyon today, eh Steve? Gotta' love a determined tailwind. DU"
    },
    {
      "id": 1212,
      "author": "Werner",
      "timestamp": "2009-01-22T21:17:46Z",
      "body": "So now we finally get the story of how Steve Austin (aka Bailey) became the [Six Million Dollar Man!](http://www.imdb.com/title/tt0071054/)"
    },
    {
      "id": 1213,
      "author": "Steve",
      "timestamp": "2009-01-22T21:33:31Z",
      "body": "I knew that by posting that video I'd resurrect the smack talk this blog is known for—it was sluggish of late. Come on, people!"
    },
    {
      "id": 1214,
      "author": "Dave",
      "timestamp": "2009-01-23T00:04:46Z",
      "body": "_I knew that by posting that video I'd resurrect the smack talk this blog is known for..._ Yeah, like dropping a ping-pong ball into a blender. DU"
    }
  ]
}