{
  "related_post_id": 4072,
  "comment_count": 3,
  "comments": [
    {
      "id": 2429,
      "author": "Werner",
      "timestamp": "2010-01-26T15:07:50Z",
      "body": "Here's my favorite passage. It's from Thomas Merton, a Cistercian Monk from his book, _Conjectures of a Guilty Bystander._ \"The rush and pressure of modern life are a form, perhaps the most common form, of its innate violence. To allow oneself to be carried away by a multitude of conflicting concerns, to surrender to too many projects, to want to help everyone in everything is to succumb to the violence of our times. The frenzy of the activist neutralizes his work for peace. It destroys his own inner capacity for peace. It destroys the fruitfulness of his own work, because it kills the root of inner wisdom which makes work fruitful.\""
    },
    {
      "id": 2430,
      "author": "Dave",
      "timestamp": "2010-01-26T19:43:59Z",
      "body": "Here's mine: \"We called them _trueons_, those brassy particles of fact around which thin clouds of nuance and doubt swirled. Even in those days, we prized them, keeping them tucked away as if buried by pirates. On rare occasion, we would share them with the odd stranger who might wander by, knowing that displaying them simultaneously destroyed them, and that truth, like all other precious commodities, was to be used ever so sparingly. So seldom, in fact, did we produce our beloved _trueons_, that that same odd stranger might have been forgiven for confusing the real for the unreal, the accurate for the absurd, and for assuming, after all, that our fragile little empire was built on nothing more than simple bulls#!t.\" From Steve Bailey's _Frenz's Progress; the Diary of a Mad Blogger_ DU"
    },
    {
      "id": 2431,
      "author": "Werner",
      "timestamp": "2010-01-26T22:03:44Z",
      "body": "Nice passage Dave. I notice that both Dave and I were able to incorporate the particle \"Frenz\" in our passages. Mine has frenzy and Dave's has Frenz. Extra points for anyone else who can include a Frenz particle in their quote!"
    }
  ]
}