[
  {
    "title": "Advice Columnist",
    "category": "LOST",
    "date": "2011-04-05",
    "body": "Dear Dave fans bereft of moral compass. Dissatisfied with “hiking the Appalachian Trail” yarn. Have concerns about lavish expenditures."
  }, 
  {
    "title": "XL Razor Scooter",
    "category": "WANTED",
    "date": "2011-03-13",
    "body": "Twizzler-armed code monkey needs beefed-up ride. Hallways at work like the autobahn. Motorized “scooters” preferred. Tweet @chowdahead."
  }, 
  {
    "title": "Knighthood",
    "category": "FOR SALE",
    "date": "2011-02-20",
    "body": "Frenzy ultra runner looking to shed weight. Can’t bear the burden of “Sir” title. Call Sir Brian Kent."
  }, 
  {
    "title": "Intervention Expert",
    "category": "HELP WANTED",
    "date": "2011-02-01",
    "body": "Riding partner has lost all common sense. Rode Flag in sub-zero temps. Claims the three falls “enriched his life.” Hitting Vegas with Charlie Sheen this weekend. Please help."
  }, 
  {
    "title": "Bad-natured Trash Talk",
    "category": "LOST",
    "date": "2011-01-23",
    "body": "Last seen wearing speedo. Abnormally furry. Responds to “Dave” or “Peaches”."
  }, 
  {
    "title": "Spare Tire",
    "category": "FOR SALE",
    "date": "2011-01-06",
    "body": "Former cyclist recently discovered he’s fat. Months of liposuction are not helping. Must now pay for said suction. $10 OBO."
  }, 
  {
    "title": "Soul",
    "category": "FOUND",
    "date": "2010-12-31",
    "body": "May belong to cycling blog. Amateur bondo work concealed by duct tape. Would pass inspection in FL. Call Mephisto."
  }, 
  {
    "title": "Executive Assistant",
    "category": "WANTED",
    "date": "2010-12-13",
    "body": "Seeking someone who can xmas shop. Impeccable taste a must. Knowledge of Dollar Store and Savers a plus. Contact HQ."
  }, 
  {
    "title": "Over-Ambitious Route Scout",
    "category": "WANTED",
    "date": "2010-11-27",
    "body": "Cycling blog running out of crazy routes to ride. Must lack ability to gauge distances and elevations. Contact Frenzy HQ."
  }, 
  {
    "title": "Almost New Bike Shorts",
    "category": "FOR RENT",
    "date": "2010-11-09",
    "body": "Seller quit cycling. Strange rash. For more info ssh into “spot”, finger “baileysm”, and find the “plan”."
  }, 
  {
    "title": "Cyclists Who Bathe",
    "category": "WANTED",
    "date": "2010-11-03",
    "body": "Showering will do. Willing to overlook all other foibles. Tired of odorous regulars. Contact the mule deer of Flagstaff Mountain."
  }, 
  {
    "title": "Gently Used Blog",
    "category": "FOR SALE",
    "date": "2010-11-02",
    "body": "Working condition. Shiftless \"contributors\" can be deleted. Owner motivated to sell. Free/OBO. Call Steve."
  }
]

